# Advanced SQL

### Using distinct and coalesce

- The coalesce function, given two or more parameters, returns the first value that is not null

In [1]:
import psycopg2
%load_ext sql

In [2]:
%%sql
postgresql://postgres:password@localhost/advanced_sql

In [3]:
%%sql
select coalesce(NULL, 'test')

 * postgresql://postgres:***@localhost/advanced_sql
1 rows affected.

[('test',)]

- the function return 'test' because the first argument is Null and the second is not null

In [4]:
%%sql
select coalesce('orange', 'test')

 * postgresql://postgres:***@localhost/advanced_sql
1 rows affected.

[('orange',)]

- the function returns the first argument, because 'orange' is not null

In [5]:
%%sql 
select description, coalesce(description, 'No description') 
from categories order by description

 * postgresql://postgres:***@localhost/advanced_sql
5 rows affected.

[('fruits', 'fruits'),
 ('fruits', 'fruits'),
 ('fruits', 'fruits'),
 ('vegetable', 'vegetable'),
 (None, 'No description')]

In [6]:
%%sql 
select coalesce(description, 'No description') as description
from categories

 * postgresql://postgres:***@localhost/advanced_sql
5 rows affected.

[('fruits',), ('fruits',), ('vegetable',), ('No description',), ('fruits',)]

- if we want to use the alias with space or capital letters we have to use quotes "".

In [7]:
%%sql 
select coalesce(description, 'No description') as "Description"
from categories

 * postgresql://postgres:***@localhost/advanced_sql
5 rows affected.

[('fruits',), ('fruits',), ('vegetable',), ('No description',), ('fruits',)]

In [8]:
%%sql
select distinct coalesce(description, 'No description') as "Description"
from categories

 * postgresql://postgres:***@localhost/advanced_sql
3 rows affected.

[('fruits',), ('vegetable',), ('No description',)]

- we have used the select distinct statement
- this query returns only different values
- internally the data is sorted
- which means that the query my becomes slower as the number of records increases

## Using subqueries

- subqueries are nested queries

### Using the IN/NOT condition

Get row with pk of 1 or 2:

In [9]:
%%sql
select * from categories where pk=1 or pk=2

 * postgresql://postgres:***@localhost/advanced_sql
2 rows affected.

[(1, 'apple', 'fruits'), (2, 'orange', 'fruits')]

In [10]:
%%sql
select * from categories where pk in (1, 2)

 * postgresql://postgres:***@localhost/advanced_sql
2 rows affected.

[(1, 'apple', 'fruits'), (2, 'orange', 'fruits')]

- get all rows except with pk 1 or 2:

In [11]:
%%sql
select * from categories where not (pk=1 or pk=2)

 * postgresql://postgres:***@localhost/advanced_sql
3 rows affected.

[(3, 'lettuce', 'vegetable'), (4, 'lemon', None), (5, 'apricot', 'fruits')]

- the *not in* operator reverses the functionality of the *in* operator

In [12]:
%%sql
select * from categories where pk not in (1, 2)

 * postgresql://postgres:***@localhost/advanced_sql
3 rows affected.

[(3, 'lettuce', 'vegetable'), (4, 'lemon', None), (5, 'apricot', 'fruits')]

The records in the post table:

In [13]:
%%sql
select pk, title, content, author, category from posts

 * postgresql://postgres:***@localhost/advanced_sql
4 rows affected.

[(1, 'my orange', 'my orange is the best orange in the world', 1, 2),
 (2, 'my apple', 'my apple is the best orange in the world', 1, 1),
 (3, 'Re:my orange', "No! It's my orange the best orange in the world", 2, 2),
 (4, 'my tomato', 'my tomato is the best orange in the world', 2, 6)]

Search all posts that belong to the orange category using subqueries.

In [14]:
%%sql
select pk,title, content, author, category from posts where category in 
(select pk from categories where title = 'orange')

 * postgresql://postgres:***@localhost/advanced_sql
2 rows affected.

[(1, 'my orange', 'my orange is the best orange in the world', 1, 2),
 (3, 'Re:my orange', "No! It's my orange the best orange in the world", 2, 2)]

In [15]:
%%sql
select pk from categories where title = 'orange'

 * postgresql://postgres:***@localhost/advanced_sql
1 rows affected.

[(2,)]

In [16]:
%%sql
select pk,title, content, author, category from posts where category not in 
(select pk from categories where title = 'orange')

 * postgresql://postgres:***@localhost/advanced_sql
2 rows affected.

[(2, 'my apple', 'my apple is the best orange in the world', 1, 1),
 (4, 'my tomato', 'my tomato is the best orange in the world', 2, 6)]

In [17]:
%%sql
select p.pk as p_pk,p.title, p.category, c.pk as c_pk, c.title from posts as p, categories as c 
where p.category = c.pk and c.title = 'orange'

 * postgresql://postgres:***@localhost/advanced_sql
2 rows affected.

[(1, 'my orange', 2, 2, 'orange'), (3, 'Re:my orange', 2, 2, 'orange')]

### Using the Exists/NOT EXISTS condition

The Exists statement is used when we want to check whether a subquery returns (True).
For example:

In [18]:
%%sql
select pk,title, content, author, category from posts where exists 
(select pk from categories where title = 'orange' and posts.category=categories.pk)

 * postgresql://postgres:***@localhost/advanced_sql
2 rows affected.

[(1, 'my orange', 'my orange is the best orange in the world', 1, 2),
 (3, 'Re:my orange', "No! It's my orange the best orange in the world", 2, 2)]

- for each post in the posts table, the subquery checks the categories table
to find a category in the posts table (posts.category=categories.pk) and the title of the category='orange'

Both queries written with the in condition and with the exists condition are called **semi-join queries**.

## Learning joins
- joins are a combination from the rows of two or more tables

For example, the following query returns all the combinations from the rows from the categories and the post table:

In [19]:
%%sql
select c.pk,c.title,p.pk,p.category,p.title from categories c,posts p

 * postgresql://postgres:***@localhost/advanced_sql
20 rows affected.

[(1, 'apple', 1, 2, 'my orange'),
 (2, 'orange', 1, 2, 'my orange'),
 (3, 'lettuce', 1, 2, 'my orange'),
 (4, 'lemon', 1, 2, 'my orange'),
 (5, 'apricot', 1, 2, 'my orange'),
 (1, 'apple', 2, 1, 'my apple'),
 (2, 'orange', 2, 1, 'my apple'),
 (3, 'lettuce', 2, 1, 'my apple'),
 (4, 'lemon', 2, 1, 'my apple'),
 (5, 'apricot', 2, 1, 'my apple'),
 (1, 'apple', 3, 2, 'Re:my orange'),
 (2, 'orange', 3, 2, 'Re:my orange'),
 (3, 'lettuce', 3, 2, 'Re:my orange'),
 (4, 'lemon', 3, 2, 'Re:my orange'),
 (5, 'apricot', 3, 2, 'Re:my orange'),
 (1, 'apple', 4, 6, 'my tomato'),
 (2, 'orange', 4, 6, 'my tomato'),
 (3, 'lettuce', 4, 6, 'my tomato'),
 (4, 'lemon', 4, 6, 'my tomato'),
 (5, 'apricot', 4, 6, 'my tomato')]

- this query makes a cartasian product between categories and posts.
- it can be called **cross join**
- it can also be written as:

In [20]:
%%sql
select c.pk,c.title,p.pk,p.category,p.title from categories c CROSS JOIN posts p

 * postgresql://postgres:***@localhost/advanced_sql
20 rows affected.

[(1, 'apple', 1, 2, 'my orange'),
 (2, 'orange', 1, 2, 'my orange'),
 (3, 'lettuce', 1, 2, 'my orange'),
 (4, 'lemon', 1, 2, 'my orange'),
 (5, 'apricot', 1, 2, 'my orange'),
 (1, 'apple', 2, 1, 'my apple'),
 (2, 'orange', 2, 1, 'my apple'),
 (3, 'lettuce', 2, 1, 'my apple'),
 (4, 'lemon', 2, 1, 'my apple'),
 (5, 'apricot', 2, 1, 'my apple'),
 (1, 'apple', 3, 2, 'Re:my orange'),
 (2, 'orange', 3, 2, 'Re:my orange'),
 (3, 'lettuce', 3, 2, 'Re:my orange'),
 (4, 'lemon', 3, 2, 'Re:my orange'),
 (5, 'apricot', 3, 2, 'Re:my orange'),
 (1, 'apple', 4, 6, 'my tomato'),
 (2, 'orange', 4, 6, 'my tomato'),
 (3, 'lettuce', 4, 6, 'my tomato'),
 (4, 'lemon', 4, 6, 'my tomato'),
 (5, 'apricot', 4, 6, 'my tomato')]

![](cross-join.png)

### Using INNER JOIN

- The inner join keyword selects records that have matching values in both tables

![](inner_join.png)

In [23]:
%%sql
select c.pk,c.title,p.pk,p.category,p.title from categories c,posts p 
where c.pk=p.category

 * postgresql://postgres:***@localhost/advanced_sql
4 rows affected.

[(2, 'orange', 1, 2, 'my orange'),
 (1, 'apple', 2, 1, 'my apple'),
 (2, 'orange', 3, 2, 'Re:my orange'),
 (6, 'tomato', 4, 6, 'my tomato')]

In [24]:
%%sql
select c.pk,c.title,p.pk,p.category,p.title from categories c 
inner join posts p on c.pk=p.category

 * postgresql://postgres:***@localhost/advanced_sql
4 rows affected.

[(2, 'orange', 1, 2, 'my orange'),
 (1, 'apple', 2, 1, 'my apple'),
 (2, 'orange', 3, 2, 'Re:my orange'),
 (6, 'tomato', 4, 6, 'my tomato')]

### Inner JOIN versus EXISTS/IN
- Using inner join condition, we can rewrite all queries that can be written using the IN or EXISTS condition.
- the join condition is preferable, because it performs better than

In [25]:
%%sql
select p.pk,p.title,p.content,p.author,p.category from categories c 
inner join posts p on c.pk=p.category where c.title='orange'

 * postgresql://postgres:***@localhost/advanced_sql
2 rows affected.

[(1, 'my orange', 'my orange is the best orange in the world', 1, 2),
 (3, 'Re:my orange', "No! It's my orange the best orange in the world", 2, 2)]

### Using Left joins

In [27]:
%%sql
select c.*,p.category, p.title from categories c 
left join posts p on p.category=c.pk

 * postgresql://postgres:***@localhost/advanced_sql
7 rows affected.

[(2, 'orange', 'fruits', 2, 'my orange'),
 (1, 'apple', 'fruits', 1, 'my apple'),
 (2, 'orange', 'fruits', 2, 'Re:my orange'),
 (6, 'tomato', 'vegetable', 6, 'my tomato'),
 (5, 'apricot', 'fruits', None, None),
 (4, 'lemon', None, None, None),
 (3, 'lettuce', 'vegetable', None, None)]

- this query returns all records of the categories table and returns the matched records
from the post table.
- if the second table (posts) has no matches, the result is null.

![](left-join.png)

- Suppose we want to search for all categories that do not have posts:

In [31]:
%%sql
select c.* from categories c
where c.pk not in 
(select category from posts)

 * postgresql://postgres:***@localhost/advanced_sql
3 rows affected.

[(3, 'lettuce', 'vegetable'), (4, 'lemon', None), (5, 'apricot', 'fruits')]

In [35]:
%%sql
select c.* from categories c 
left join posts p on p.category=c.pk
where p.category is null

 * postgresql://postgres:***@localhost/advanced_sql
3 rows affected.

[(3, 'lettuce', 'vegetable'), (4, 'lemon', None), (5, 'apricot', 'fruits')]

### Using Right join
- we can obtain the same result with right join:

In [36]:
%%sql
select c.*,p.category,p.title from posts p right join categories c on c.pk=p.category;

 * postgresql://postgres:***@localhost/advanced_sql
7 rows affected.

[(2, 'orange', 'fruits', 2, 'my orange'),
 (1, 'apple', 'fruits', 1, 'my apple'),
 (2, 'orange', 'fruits', 2, 'Re:my orange'),
 (6, 'tomato', 'vegetable', 6, 'my tomato'),
 (5, 'apricot', 'fruits', None, None),
 (4, 'lemon', None, None, None),
 (3, 'lettuce', 'vegetable', None, None)]

In [37]:
%%sql
select c.*,p.category, p.title from categories c 
right join posts p on p.category=c.pk

 * postgresql://postgres:***@localhost/advanced_sql
4 rows affected.

[(2, 'orange', 'fruits', 2, 'my orange'),
 (1, 'apple', 'fruits', 1, 'my apple'),
 (2, 'orange', 'fruits', 2, 'Re:my orange'),
 (6, 'tomato', 'vegetable', 6, 'my tomato')]

![](right-join.png)

### Full outer join
- is the combination of what we would have if we put together the right join and the left join

![](full-join.png)

In [38]:
%%sql
select *
from categories c
full join posts p on p.category = c.pk

 * postgresql://postgres:***@localhost/advanced_sql
7 rows affected.

[(2, 'orange', 'fruits', 1, 'my orange', 'my orange is the best orange in the world', 1, 2),
 (1, 'apple', 'fruits', 2, 'my apple', 'my apple is the best orange in the world', 1, 1),
 (2, 'orange', 'fruits', 3, 'Re:my orange', "No! It's my orange the best orange in the world", 2, 2),
 (6, 'tomato', 'vegetable', 4, 'my tomato', 'my tomato is the best orange in the world', 2, 6),
 (5, 'apricot', 'fruits', None, None, None, None, None),
 (4, 'lemon', None, None, None, None, None, None),
 (3, 'lettuce', 'vegetable', None, None, None, None, None)]

### Using self-join

Suppose we wanted to find all posts that belong to author 2 that have the same
category as those entered by author 1.

1. step: (search all records that belong to author 1)

In [43]:
%%sql
select distinct p1.title, p1.author, p1.category from posts p1
where p1.author = 1

 * postgresql://postgres:***@localhost/advanced_sql
3 rows affected.

[('my apple', 1, 1), ('my new orange', 1, 2), ('my orange', 1, 2)]

2. step: (search all records that belong to author 2)

In [44]:
%%sql
select distinct p2.title, p2.author, p2.category from posts p2
where p2.author = 2

 * postgresql://postgres:***@localhost/advanced_sql
2 rows affected.

[('my tomato', 2, 6), ('Re:my orange', 2, 2)]

In [47]:
%%sql
select distinct p2.title, p2.author, p2.category from posts p2, posts p1
where p1.category=p2.category and
p1.author = 1 and p2.author=2

 * postgresql://postgres:***@localhost/advanced_sql
1 rows affected.

[('Re:my orange', 2, 2)]

In [48]:
%%sql
select distinct p2.title, p2.author, p2.category from posts p2
inner join posts p1 on (p1.category=p2.category)
where p1.author = 1 and p2.author=2

 * postgresql://postgres:***@localhost/advanced_sql
1 rows affected.

[('Re:my orange', 2, 2)]

- alias must be used for table names when a self join is performed

## Multiple joins

In [50]:
%%sql
select * from student

 * postgresql://postgres:***@localhost/advanced_sql
12 rows affected.

[(12, 'Wayne Green', 'New York', None, 1),
 (2, 'Maria Highsmith', 'New York', 3, 1),
 (10, 'John Goldwin', 'Chicago', 6, 2),
 (3, 'Aimaar Abdul', 'Chicago', 1, 2),
 (7, 'Irmgard Seekircher', 'Berlin', 7, 3),
 (5, 'Gerald Hutticher', 'Berlin', 6, 3),
 (4, 'Gudrun Schmidt', 'Berlin', 5, 3),
 (11, 'Emilio Ramiro', 'Barcelona', None, 6),
 (6, 'Itzi Elizabal', 'Barcelona', 4, 6),
 (1, 'Dolores Perez', 'Barcelona', 2, 6),
 (9, 'Alex Anjou', 'Paris', 3, 7),
 (8, 'Christian Blanc', 'Paris', 4, 7)]

In [52]:
%%sql
select * from mentor

 * postgresql://postgres:***@localhost/advanced_sql
9 rows affected.

[(1, 'Peter Smith', 'New York'),
 (2, 'Laura Wild', 'Chicago'),
 (3, 'Julius Maxim', 'Berlin'),
 (4, "Melinda O'Connor", 'Berlin'),
 (5, 'Patricia Boulard', 'Marseille'),
 (6, 'Julia Vila', 'Barcelona'),
 (7, 'Fabienne Martin', 'Paris'),
 (8, 'Rose Dupond', 'Brussels'),
 (9, 'Ahmed Ali', 'Marseille')]

In [64]:
%%sql
SELECT
    s.name,
    m.name
FROM student s
LEFT JOIN mentor m ON s.mentor_id = m.id

ORDER BY s.name;

 * postgresql://postgres:***@localhost/advanced_sql
12 rows affected.

[('Aimaar Abdul', 'Peter Smith'),
 ('Alex Anjou', 'Julius Maxim'),
 ('Christian Blanc', "Melinda O'Connor"),
 ('Dolores Perez', 'Laura Wild'),
 ('Emilio Ramiro', None),
 ('Gerald Hutticher', 'Julia Vila'),
 ('Gudrun Schmidt', 'Patricia Boulard'),
 ('Irmgard Seekircher', 'Fabienne Martin'),
 ('Itzi Elizabal', "Melinda O'Connor"),
 ('John Goldwin', 'Julia Vila'),
 ('Maria Highsmith', 'Julius Maxim'),
 ('Wayne Green', None)]

In [65]:
%%sql
SELECT
    s.name,
    m.name
FROM student s
LEFT JOIN mentor m ON s.local_mentor = m.id

ORDER BY s.name;

 * postgresql://postgres:***@localhost/advanced_sql
12 rows affected.

[('Aimaar Abdul', 'Laura Wild'),
 ('Alex Anjou', 'Fabienne Martin'),
 ('Christian Blanc', 'Fabienne Martin'),
 ('Dolores Perez', 'Julia Vila'),
 ('Emilio Ramiro', 'Julia Vila'),
 ('Gerald Hutticher', 'Julius Maxim'),
 ('Gudrun Schmidt', 'Julius Maxim'),
 ('Irmgard Seekircher', 'Julius Maxim'),
 ('Itzi Elizabal', 'Julia Vila'),
 ('John Goldwin', 'Laura Wild'),
 ('Maria Highsmith', 'Peter Smith'),
 ('Wayne Green', 'Peter Smith')]

In [66]:
%%sql
SELECT
    s.name,
    m1.name,
    m2.name
FROM student s
LEFT JOIN mentor m1 ON s.mentor_id = m1.id
LEFT JOIN mentor m2 ON s.local_mentor = m2.id

ORDER BY s.name;

 * postgresql://postgres:***@localhost/advanced_sql
12 rows affected.

[('Aimaar Abdul', 'Peter Smith', 'Laura Wild'),
 ('Alex Anjou', 'Julius Maxim', 'Fabienne Martin'),
 ('Christian Blanc', "Melinda O'Connor", 'Fabienne Martin'),
 ('Dolores Perez', 'Laura Wild', 'Julia Vila'),
 ('Emilio Ramiro', None, 'Julia Vila'),
 ('Gerald Hutticher', 'Julia Vila', 'Julius Maxim'),
 ('Gudrun Schmidt', 'Patricia Boulard', 'Julius Maxim'),
 ('Irmgard Seekircher', 'Fabienne Martin', 'Julius Maxim'),
 ('Itzi Elizabal', "Melinda O'Connor", 'Julia Vila'),
 ('John Goldwin', 'Julia Vila', 'Laura Wild'),
 ('Maria Highsmith', 'Julius Maxim', 'Peter Smith'),
 ('Wayne Green', None, 'Peter Smith')]

In [76]:
%%sql
select s.name, m.name, m2.name from student s, mentor m, mentor m2
where m.id = s.mentor_id and
m2.id = s.local_mentor
order by s.name

 * postgresql://postgres:***@localhost/advanced_sql
10 rows affected.

[('Aimaar Abdul', 'Peter Smith', 'Laura Wild'),
 ('Alex Anjou', 'Julius Maxim', 'Fabienne Martin'),
 ('Christian Blanc', "Melinda O'Connor", 'Fabienne Martin'),
 ('Dolores Perez', 'Laura Wild', 'Julia Vila'),
 ('Gerald Hutticher', 'Julia Vila', 'Julius Maxim'),
 ('Gudrun Schmidt', 'Patricia Boulard', 'Julius Maxim'),
 ('Irmgard Seekircher', 'Fabienne Martin', 'Julius Maxim'),
 ('Itzi Elizabal', "Melinda O'Connor", 'Julia Vila'),
 ('John Goldwin', 'Julia Vila', 'Laura Wild'),
 ('Maria Highsmith', 'Julius Maxim', 'Peter Smith')]